using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Chapter11
{
    class Exercise1
    {
        public void Show()
        {
            Console.WriteLine(@"
Создайте класс коллекции по имени People для хранения экземпляров приведенного 
ниже класса Person. Элементы в этой коллекции должны быть доступны через 
строковый индексатор, в роли которого должно выступать имя человека, 
идентичное хранящемуся в свойстве Person.Name.
                            ");

        }
    }
}