using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Chapter13
{
    class Exercise2
    {
        public void Show()
        {
            Console.WriteLine(@"
Модифицируйте пример приложения карточной игры, добавив проверку
более интересного условия выигрыша, как в популярной карточной игре 
“рамми”. Выигравшим при этом считается игрок, у которого на руках 
оказывается два “набора” карт — один из трех карт и второй из четырех
карт. Под набором понимается либо последовательность карт одной масти 
(например, 3 червей, 4 червей, 5 червей, 6 червей), либо несколько карт 
одного достоинства (например, 2 червей, 2 пик, 2 бубен). 
                            ");
        }
    }
}
