using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Chapter9
{
    class Exercise4
    {
        public void Show()
        {
            Console.WriteLine(@"
Создайте проект библиотеки классов с именем Vehicles и напишите в нем код, реали-
зующий семейство описанных в этой главе классов Vehicle. Нужно реализовать девять 
классов и два интерфейса.
                            ");
        }
    }
}
